Repository: yourcontractservice/vstest
Catalog: src/vstest.console/Resources/xlf/Resources.*.xlf
Languages: cs, ko, zh_hans

# FileNotFound
source: '{0}' not found.
cs: {0} se nenašel.
ko: '{0}'을(를) 찾을 수 없습니다.
zh_hans: 未找到“{0}”。

# AvailableDiscoverersHeaderMessage
source: The following Test Discovery Add-Ins are available:
cs: Jsou k dispozici tyto doplňky zjišťování testů:
ko: 다음 테스트 검색 추가 기능을 사용할 수 있습니다.
zh_hans: 以下测试发现外接程序可用:

# AvailableExecutorsHeaderMessage
source: The following Test Execution Add-Ins are available:
cs: Jsou k dispozici tyto doplňky pro provádění testů:
ko: 다음 테스트 실행 추가 기능을 사용할 수 있습니다.
zh_hans: 以下测试执行外接程序可用:

# AvailableLoggersHeaderMessage
source: The following Test Logger Add-Ins are available:
cs: Jsou k dispozici tyto doplňky protokolovače testu:
ko: 다음 테스트 로거 추가 기능을 사용할 수 있습니다.
zh_hans: 以下测试记录器加载项可用:

# CommandLineError
source: Error: {0}
cs: Chyba: {0}
ko: 오류: {0}
zh_hans: 错误: {0}

# DuplicateArgumentError
source: The parameter "{0}" should be provided only once.
cs: Parametr {0} by se měl poskytnout jenom jednou.
ko: "{0}" 매개 변수는 한 번만 제공해야 합니다.
zh_hans: 应只提供一次参数“{0}”。

# ExceptionFromExtension
source: Exception occurred when instantiating extension '{0}': {1}
cs: Při vytváření instance rozšíření {0} došlo k výjimce: {1}
ko: '{0}' 확장을 인스턴스화할 때 예외가 발생했습니다. {1}
zh_hans: 实例化扩展“{0}”时出现异常: {1}

# ListTestsHeaderMessage
source: The following Tests are available:
cs: Jsou k dispozici následující testy:
ko: 다음 테스트를 사용할 수 있습니다.
zh_hans: 以下测试可用:

# NoArgumentProcessorFound
source: Unrecognized parameter "{0}".
cs: Nerozpoznaný parametr {0}
ko: "{0}" 매개 변수를 인식할 수 없습니다.
zh_hans: 无法识别的参数“{0}”。

# TestSourceFileNotFound
source: The test source file "{0}" provided was not found.
cs: Poskytnutý zdrojový soubor testu {0} se nenašel.
ko: 제공된 테스트 소스 파일 "{0}"을(를) 찾을 수 없습니다.
zh_hans: 找不到提供的测试源文件“{0}”。

# LoggerUriInvalid
source: The Test Logger URI '{0}' is not valid. The Test Logger will be ignored.
cs: Identifikátor URI {0} protokolovače testu není platný. Protokolovač testu se bude ignorovat.
ko: 테스트 로거 URI '{0}'이(가) 잘못되었습니다. 테스트 로거를 무시합니다.
zh_hans: 测试记录器 URI“{0}”无效。将忽略该测试记录器。

# CommandLineInformational
source: Information: {0}
cs: Informace: {0}
ko: 정보: {0}
zh_hans: 信息: {0}

# CommandLineWarning
source: Warning: {0}
cs: Upozornění: {0}
ko: 경고: {0}
zh_hans: 警告: {0}

# HelpArgumentHelp
source: -?|--Help|/?|/Help Display this usage message.
cs: -?|--Help|/?|/Help Zobrazí tuto zprávu o používání.
ko: -?|--Help|/?|/Help 이 사용법 메시지를 표시합니다.
zh_hans: -?|--Help|/?|/Help 显示此用法信息。

# CopyrightCommandLineTitle
source: Copyright (c) Microsoft Corporation. All rights reserved.
cs: Copyright (c) Microsoft Corporation. Všechna práva vyhrazena.
zh_hans: 版权所有 (C) Microsoft Corporation。保留所有权利。

# MicrosoftCommandLineTitle
source: Microsoft (R) Test Execution Command Line Tool Version {0}
cs: Microsoft (R) Test Execution Command Line Tool verze {0}
zh_hans: Microsoft (R) 测试执行命令行工具版本 {0}

# EnableLoggersArgumentHelp
source: --logger|/logger:<Logger Uri/FriendlyName> Specify a logger for test results. For example, to log results into a Visual Studio Test Results File (TRX) use /logger:trx[;LogFileName=<Defaults to unique file name>] Creates file in TestResults directory with given LogFileName. Change the verbosity level in log messages for console logger as shown below Example: /logger:console;verbosity=<Defaults to "normal"> Allowed values for verbosity: quiet, minimal, normal and detailed. Change the diagnostic level prefix for console logger as shown below Example: /logger:console;prefix=<Defaults to "false"> More info on Console Logger here : https://aka.ms/console-logger
cs: --logger|/logger:<identifikátor URI nebo popisný název protokolovacího nástroje> Určuje protokolovací nástroj pro výsledky testu. Pokud chcete protokolovat výsledky třeba do souboru výsledků testu sady Visual Studio (TRX), použijte /logger:trx[;LogFileName=<výchozí hodnota je jedinečný název souboru>] Vytvoří soubor v adresáři TestResults s daným LogFileName. Změní úroveň podrobností ve zprávách protokolu pro protokolovací nástroj konzoly tak, jak je uvedeno níže. Příklad: /logger:console;verbosity=<výchozí hodnota je normal> Povolené hodnoty pro verbosity: quiet, minimal, normal a detailed Změní předponu úrovně diagnostiky pro protokolovací nástroj konzoly tak, jak je uvedeno níže. Příklad: /logger:console;prefix=<výchozí hodnota je false> Další informace o protokolovacím nástroji konzoly: https://aka.ms/console-logger
ko: --logger|/logger:<Logger Uri/FriendlyName> 테스트 결과의 로거를 지정합니다. 예를 들어 Visual Studio TRX(테스트 결과 파일)에 결과를 기록하려면 /logger:trx[;LogFileName=<Defaults to unique file name>]를 사용합니다. 지정된 LogFileName으로 TestResults 디렉터리에서 파일을 만듭니다. 아래 표시된 대로 콘솔 로거에 대한 로그 메시지에서 세부 정보 표시 수준을 변경합니다. 예: /logger:console;verbosity=<Defaults to "normal"> 허용된 세부 정보 표시 값: quiet, minimal, normal 및 detailed. 아래 표시된 대로 콘솔 로거에 대한 진단 수준 접두사를 변경합니다. 예: /logger:console;prefix=<Defaults to "false"> 콘솔 로거에 대한 자세한 내용은 https://aka.ms/console-logger를 참조하세요.
zh_hans: --logger|/logger:<Logger Uri/FriendlyName> 为测试结果指定一个记录器。例如，若要将结果记录到 Visual Studio 测试结果文件(TRX)中，请使用/logger:trx[;LogFileName=<Defaults to unique file name>] 使用给定的 LogFileName 在 TestResults 目录中创建文件。 更改控制台记录器的日志消息中的详细程度，如下所示 示例: /logger:console;verbosity<Defaults to "normal"> 允许的详细程度的值: quiet、minimal、normal 和 detailed。 更改控制台记录器的诊断级别前缀，如下所示 示例: /logger:console;prefix=<Defaults to "false"> 此处为控制台记录器的详细信息: https://aka.ms/console-logger

# HelpDescriptionText
source: Description: Runs tests from the specified files.
cs: Popis: Spustí testy ze zadaných souborů.
ko: 설명: 지정한 파일에서 테스트를 실행합니다.
zh_hans: 说明: 从指定的文件运行测试。

# HelpOptionsText
source: Options:
cs: Možnosti:
ko: 옵션:
zh_hans: 选项:

# HelpUsageText
source: Usage: vstest.console.exe [Arguments] [Options] [[--] <RunSettings arguments>...]]
cs: Použití: vstest.console.exe [argumenty] [možnosti] [[--] <argumenty RunSettings>...]]
ko: 사용법: vstest.console.exe [Arguments] [Options] [[--] <RunSettings arguments>...]]
zh_hans: 用法: vstest.console.exe [Arguments] [Options] [[--] <RunSettings arguments>...]]

# MissingTestSourceFile
source: No test source files were specified.
cs: Nezadaly se žádné zdrojové soubory testů.
ko: 테스트 소스 파일을 지정하지 않았습니다.
zh_hans: 未指定测试源文件。

# NoArgumentsProvided
source: No arguments were specified.
cs: Nezadaly se žádné argumenty.
ko: 인수를 지정하지 않았습니다.
zh_hans: 未指定参数。

# RunTestsArgumentHelp
source: [TestFileNames] Run tests from the specified files or wild card pattern. Separate multiple test file names or pattern by spaces. Set console logger verbosity to detailed to view matched test files. Examples: mytestproject.dll mytestproject.dll myothertestproject.exe testproject*.dll my*project.dll
cs: [TestFileNames] Spusťte testy ze zadaných souborů nebo ze vzoru se zástupnými znaky. Oddělte více názvů nebo vzorů testovacích souborů pomocí mezer. Nastavte úroveň podrobností protokolovacího nástroje konzoly na podrobnou, aby se zobrazily odpovídající testovací soubory. Příklady: mytestproject.dll mytestproject.dll myothertestproject.exe testproject*.dll my*project.dll
ko: [TestFileNames] 지정된 파일 또는 와일드카드 패턴에서 테스트를 실행합니다. 여러 테스트 파일 이름 또는 패턴을 공백으로 구분합니다. 일치한 테스트 파일을 보려면 콘솔 로거 세부 정보 표시를 [상세]로 설정합니다. 예: mytestproject.dll mytestproject.dll myothertestproject.exe testproject*.dll my*project.dll
zh_hans: [TestFileNames] 从指定的文件或通配符模式运行测试。通过空格将多个测试文件或模式分隔开来。 将控制台记录器详细程度设置为“详细”以查看匹配的测试文件。 示例: mytestproject.dll mytestproject.dll myothertestproject.exe testproject*.dll my*project.dll

# AvailableSettingsProvidersHeaderMessage
source: The following Settings Providers Add-Ins are available:
cs: Jsou k dispozici tyto doplňky poskytovatelů nastavení:
ko: 다음 설정 공급자 추가 기능을 사용할 수 있습니다.
zh_hans: 以下设置提供程序外接程序可用:

# RunSettingsArgumentHelp
source: --Settings|/Settings:<Settings File> Settings to use when running tests.
cs: --Settings|/Settings:<soubor nastavení> Nastavení, která se použijí při testování.
ko: --Settings|/Settings:<Settings File> 테스트를 실행할 때 사용할 설정입니다.
zh_hans: --Settings|/Settings:<Settings File> 运行测试时要使用的设置。

# RunSettingsRequired
source: The /Settings parameter requires a settings file to be provided.
cs: Parametr /Settings vyžaduje, aby se poskytl soubor nastavení.
ko: /Settings 매개 변수에는 설정 파일을 제공해야 합니다.
zh_hans: /Settings 参数要求提供设置文件。

# RunSettingsFileNotFound
source: The Settings file '{0}' could not be found.
cs: Soubor nastavení {0} se nenašel.
ko: 설정 파일 '{0}'을(를) 찾을 수 없습니다.
zh_hans: 找不到设置文件“{0}”。

source: Test Run Failed.
cs: Testovací běh nebyl úspěšný.
ko: 테스트 실행이 실패했습니다.
zh_hans: 测试运行失败。

source: Test Run Successful.
cs: Testovací běh byl úspěšný.
ko: 테스트를 실행했습니다.
zh_hans: 测试运行成功。

# InvalidInIsolationCommand
source: Argument {0} is not expected in the 'InIsolation' command. Specify the command without the argument (Example: vstest.console.exe myTests.dll /InIsolation) and try again.
cs: V příkazu InIsolation se argument {0} neočekává. Zadejte příkaz bez tohoto argumentu (třeba vstest.console.exe myTests.dll /InIsolation) a zkuste to znovu.
ko: 'InIsolation' 명령에는 {0} 인수가 필요하지 않습니다. 인수 없이 명령을 지정한 다음(예: vstest.console.exe myTests.dll /InIsolation) 다시 시도하세요.
zh_hans: 参数 {0} 不应出现在 "InIsolation" 命令中。指定不带该参数的命令(示例: vstest.console.exe myTests.dll /InIsolation)，然后重试。

# UseVsixExtensionsValueRequired
source: The /UseVsixExtensions parameter requires a value. If 'true', the installed VSIX extensions (if any) will be used in the test run. If false, they will be ignored. Example: /UseVsixExtensions:true
cs: Parametr /UseVsixExtensions vyžaduje hodnotu. Pokud hodnota bude true, v testovacím běhu se použijí nainstalovaná rozšíření VSIX (pokud nějaká jsou). Pokud je hodnota false, budou se rozšíření ignorovat. Příklad: /UseVsixExtensions:true
ko: /UseVsixExtensions 매개 변수에는 값이 필요합니다. 'true'인 경우 테스트 실행에서 설치된 VSIX 확장(있는 경우)이 사용됩니다. false인 경우에는 확장이 무시됩니다. 예: /UseVsixExtensions:true
zh_hans: /UseVsixExtensions 参数需要一个值。如果值为 "true"，则安装的 VSIX 扩展(如果有)将用在测试运行中。如果值为 "false"，则将其忽略。示例: /UseVsixExtensions:true

# InvalidUseVsixExtensionsCommand
source: Argument {0} is not expected in the 'UseVsixExtensions' command. Specify the command indicating whether the vsix extensions should be used or skipped (Example: vstest.console.exe myTests.dll /UseVsixExtensions:true) and try again.
cs: V příkazu UseVsixExtensions se argument {0} neočekává. Zadejte příkaz, který určí, jestli se mají rozšíření vsix používat, nebo přeskočit (třeba vstest.console.exe myTests.dll /UseVsixExtensions:true) a zkuste to znovu.
ko: 'UseVsixExtensions' 명령에는 {0} 인수가 필요하지 않습니다. vstest.console.exe myTests.dll /UseVsixExtensions:true와 같이 vsix 확장을 사용할지 건너뛸지를 나타내는 명령을 지정하고 다시 시도하세요.
zh_hans: 参数 {0} 不应出现在 "UseVsixExtensions" 命令中。指定指示是否应使用或跳过 vsix 扩展的命令(示例：vstest.console.exe myTests.dll /UseVsixExtensions:true)，然后重试。

# InIsolationHelp
source: --InIsolation|/InIsolation Runs the tests in an isolated process. This makes vstest.console.exe process less likely to be stopped on an error in the tests, but tests may run slower.
cs: --InIsolation|/InIsolation Spustí testy v izolovaném procesu. Díky tomu je méně pravděpodobné, že se proces vstest.console.exe zastaví, pokud se v testech stane chyba, ale testy můžou být pomalejší.
ko: --InIsolation|/InIsolation 격리 모드에서 테스트를 실행합니다. 이렇게 하면 테스트에서 오류가 발생해도 vstest.console.exe가 중지될 가능성이 작아지지만 테스트 실행 속도가 느려질 수 있습니다.
zh_hans: --InIsolation|/InIsolation 在独立进程中运行测试。虽然这可使 vstest.console.exe 进程在测试出现错误时停止的可能性较小，但是测试的 运行速度会较慢。

# UseVsixExtensionsHelp
source: /UseVsixExtensions This makes vstest.console.exe process use or skip the VSIX extensions installed(if any) in the test run. Example /UseVsixExtensions:true
cs: /UseVsixExtensions Tato možnost určí, jestli má proces vstest.console.exe v testovacím běhu používat, nebo přeskočit nainstalovaná rozšíření VSIX (pokud nějaká jsou). Příklad: /UseVsixExtensions:true
ko: /UseVsixExtensions 이 옵션을 사용하면 vstest.console.exe 프로세스가 테스트 실행에서 설치된 VSIX 확장(있는 경우)을 사용하거나 건너뛸 수 있습니다. 예: /UseVsixExtensions:true
zh_hans: / UseVsixExtensions 这可使 vstest.console.exe 进程在测试运行中使用或者跳过 安装的 VSIX 扩展(如果有)。 示例 /UseVsixExtensions:true

# BatchSizeRequired
source: The /BatchSize argument requires the size of the batch. Example: /BatchSize:10
cs: Argument /BatchSize vyžaduje velikost dávky. Příklad: /BatchSize:10
ko: /BatchSize 인수에는 일괄 처리 크기가 필요합니다. 예: /BatchSize:10
zh_hans: /BatchSize 参数要求批的大小。示例: /BatchSize:10

# InvalidBatchSize
source: Invalid batch size {0}. The batch size should be greater than zero. Example: /BatchSize:10
cs: Neplatná velikost dávky {0}. Velikost dávky by měla být větší než nula. Příklad: /BatchSize:10
ko: 일괄 처리 크기 {0}이(가) 잘못되었습니다. 일괄 처리 크기는 0보다 커야 합니다. 예: /BatchSize:10
zh_hans: 批大小 {0} 无效。批大小应大于零。示例: /BatchSize:10

# Examples
source: To run tests: >vstest.console.exe tests.dll To run tests with additional settings such as data collectors: >vstest.console.exe tests.dll /Settings:Local.RunSettings
cs: Pro spuštění testů: >vstest.console.exe tests.dll Pro spuštění testů s dalšími nastaveními, třeba kolekcemi dat: >vstest.console.exe tests.dll /Settings:Local.RunSettings
ko: 테스트를 실행하려면: >vstest.console.exe tests.dll 데이터 수집기와 같은 추가 설정을 사용하여 테스트를 실행하려면: >vstest.console.exe tests.dll /Settings:Local.RunSettings
zh_hans: 运行测试: >vstest.console.exe tests.dll 使用其他设置(如数据收集器)运行测试: >vstest.console.exe tests.dll /Settings:Local.RunSettings

# ListDiscoverersHelp
source: /ListDiscoverers Lists installed test discoverers.
cs: /ListDiscoverers Vypíše nainstalované nástroje zjišťování testů.
ko: /ListDiscoverers 설치된 테스트 Discoverer를 나열합니다.
zh_hans: / ListDiscoverers 列出已安装的测试发现器。

# ListExecutorsHelp
source: /ListExecutors Lists installed test executors.
cs: /ListExecutors Vypíše nainstalované prováděcí moduly testů.
ko: /ListExecutors 설치된 테스트 Executor를 나열합니다.
zh_hans: / ListExecutors 列出已安装的测试执行器。

# ListLoggersHelp
source: /ListLoggers Lists installed test loggers.
cs: /ListLoggers Vypíše nainstalované protokolovače testů.
ko: /ListLoggers 설치된 테스트 로거를 나열합니다.
zh_hans: / ListLoggers 列出已安装的测试记录器。

# ListSettingsProvidersHelp
source: /ListSettingsProviders Lists installed test settings providers.
cs: /ListSettingsProviders Vypíše nainstalované poskytovatele nastavení testů.
ko: /ListSettingsProviders 설치된 테스트 설정 공급자를 나열합니다.
zh_hans: / ListSettingsProviders 列出已安装的测试设置提供程序。

# ListTestsHelp
source: -lt|--ListTests|/lt|/ListTests:<File Name> Lists all discovered tests from the given test container.
cs: -lt|--ListTests|/lt|/ListTests:<název souboru> Vypíše všechny zjištěné testy z daného kontejneru testů.
ko: -lt|--ListTests|/lt|/ListTests:<File Name> 지정된 테스트 컨테이너에서 검색된 모든 테스트를 나열합니다.
zh_hans: -lt|--ListTests|/lt|/ListTests:<File Name> 从给定测试容器中列出所有已发现的测试。

source: Time elapsed :
cs: Uplynulý čas:
ko: 경과 시간:
zh_hans: 已用时间:

# SpecificTestsRequired
source: The /Tests argument requires one or more specific test names or their substrings. Examples: /Tests:TestsMethod1, /Tests:TestMethod1,method2
cs: Argument /Tests vyžaduje aspoň jeden konkrétní název testu nebo jeho podřetězec. Příklady: /Tests:TestovaciMetoda1, /Tests:TestovaciMetoda1,metoda2
ko: /Tests 인수에는 하나 이상의 특정 테스트 이름 또는 해당 하위 문자열이 필요합니다. 예: /Tests:TestsMethod1, /Tests:TestMethod1,method2
zh_hans: /Tests 参数要求一个或多个特定测试名称或其子字符串。 示例: /Tests:TestsMethod1、/Tests:TestMethod1、method2

# NoTestsAvailableAfterFiltering
source: A total of {0} tests were discovered but no test matches the specified selection criteria({1}). Use right value(s) and try again.
cs: Zjistilo se několik testů (celkem {0}), ale žádný z testů neodpovídá zadaným kritériím výběru ({1}). Použijte správné hodnoty a zkuste to znovu.
ko: 총 {0}개의 테스트가 검색되었지만 지정된 선택 기준({1})과 일치하는 테스트가 없습니다. 올바른 값을 사용하여 다시 시도하세요.
zh_hans: 共发现 {0} 个测试，但没有与指定选择条件 ({1}) 匹配的测试。使用正确的值，然后重试。

# RunSpecificTestsHelp
source: --Tests|/Tests:<Test Names> Run tests with names that match the provided values. To provide multiple values, separate them by commas. Examples: /Tests:TestMethod1 /Tests:TestMethod1,testMethod2
cs: --Tests|/Tests:<názvy testů> Spustí testy s názvy odpovídajícími zadaným hodnotám. Chcete-li zadat více hodnot, oddělte je čárkami. Příklady: /Tests:TestMethod1 /Tests:TestMethod1,testMethod2
ko: --Tests|/Tests:<Test Names> 제공된 값과 일치하는 이름으로 테스트를 실행합니다. 여러 값을 제공하려면 쉼표로 구분합니다. 예: /Tests:TestMethod1 /Tests:TestMethod1,testMethod2
zh_hans: --Tests|/Tests:<Test Names> 运行其名称与所提供值相匹配的测试。若要提供多个 值，请用逗号将这些值分隔开。 示例: /Tests:TestMethod1 /Tests:TestMethod1,testMethod2

# SwitchToNoIsolation
source: Using Isolation mode to run the tests as diagnostic data adapters were enabled in the runsettings. Use the /inIsolation parameter to suppress this warning.
cs: Ke spouštění testů se používá režim izolace, protože v nastavení Runsettings se povolily adaptéry diagnostických dat. Pokud chcete toto upozornění potlačit, použijte parametr /InIsolation.
ko: 진단 데이터 어댑터가 runsettings에서 사용하도록 설정되었으므로 격리 모드를 사용하여 테스트를 실행합니다. 이 경고를 표시하지 않으려면 /inIsolation 매개 변수를 사용하세요.
zh_hans: 使用隔离模式运行测试，因为已在 runsettings 中启用了诊断数据适配器。使用 /inIsolation 参数取消此警告。

# SwitchToIsolationInAppContainerMode
source: Using Isolation mode to run unit tests for Windows Store apps. Use the /InIsolation parameter to suppress this warning.
cs: Ke spouštění testů jednotek pro aplikace pro Windows Store se používá režim izolace. Pokud chcete toto upozornění potlačit, použijte parametr /InIsolation.
ko: 격리 모드를 사용하여 Windows 스토어 앱에 대한 단위 테스트를 실행합니다. 이 경고를 표시하지 않으려면 /InIsolation 매개 변수를 사용하세요.
zh_hans: 使用隔离模式为 Windows 应用商店应用运行单元测试。使用 /InIsolation 参数取消此警告。

# DisablingDataCollectionInAppContainerTestExecution
source: Diagnostic data adapters are not supported when running unit tests for Windows Store apps. Remove diagnostic data adapters settings from settings.
cs: Pokud se spouští testy jednotek pro aplikace pro Windows Store, nepodporují se adaptéry diagnostických dat. Odeberte nastavení adaptérů diagnostických dat z nastavení.
ko: Windows 스토어 앱에 대한 단위 테스트를 실행할 때는 진단 데이터 어댑터가 지원되지 않습니다. 설정에서 진단 데이터 어댑터 설정을 제거하세요.
zh_hans: 为 Windows 应用商店应用运行单元测试时不支持诊断数据适配器。从设置中删除诊断数据适配器设置。

# LoggerFriendlyNameFormat
source: FriendlyName: {0}
cs: PopisnýNázev: {0}

# ExtensionUriFormat
source: Uri: {0}
cs: Identifikátor URI: {0}

# SettingFormat
source: SettingName: {0}
cs: NázevNastavení: {0}

# SupportedFileTypesIndicator
source: Supported File Types:
cs: Podporované typy souborů:
ko: 지원되는 파일 형식:
zh_hans: 支持的文件类型:

# UriOfDefaultExecutor
source: Default Executor Uri: {0}
cs: Identifikátor URI výchozího prováděcího modulu: {0}
ko: 기본 Executor URI: {0}
zh_hans: 默认执行器 URI: {0}

# LoggerUriFormat
source: Uri: {0}
cs: Identifikátor URI: {0}

# InvalidPlatformType
source: Invalid platform type:{0}. Valid platform types are x86, x64 and Arm.
cs: Neplatný typ platformy: {0}. Platné typy platformy jsou x86, x64 a Arm.
ko: 플랫폼 형식({0})이 잘못되었습니다. 올바른 플랫폼 형식은 x86, x64, Arm입니다.
zh_hans: 无效的平台类型: {0}。有效平台类型为 x86、x64 和 ARM。

# PlatformTypeRequired
source: The /Platform argument requires the target platform type for the test run to be provided. Example: /Platform:x86
cs: Argument /Platform vyžaduje, aby se pro testovací běh poskytl typ platformy. Příklad: /Platform:x86
ko: /Platform 인수에는 테스트 실행의 대상 플랫폼 형식을 제공해야 합니다. 예: /Platform:x86
zh_hans: /Platform 参数要求提供用于测试运行的目标平台类型。示例: /Platform:x86

# PlatformArgumentHelp
source: --Platform|/Platform:<Platform type> Target platform architecture to be used for test execution. Valid values are x86, x64 and ARM.
cs: --Platform|/Platform:<typ platformy> Cílová architektura platformy, která se použije ke spuštění testu. Platné hodnoty jsou x86, x64 a ARM.
ko: --Platform|/Platform:<Platform type> 테스트를 실행하는 데 사용할 대상 플랫폼 아키텍처입니다. 유효한 값은 x86, x64 및 ARM입니다.
zh_hans: --Platform|/Platform:<Platform type> 用于执行测试的目标平台体系结构。 有效值为 x86、x64 和 ARM。

# SwitchToIsolationInMultiTargetingMode
source: Using Isolation mode to run tests as required by effective Platform:{0} and .Net Framework:{1} settings for test run. Use the /inIsolation parameter to suppress this warning.
cs: Pro provádění testů se používá režim izolace tak, jak to vyžaduje nastavení platformy {0} a rozhraní .NET Framework {1} pro testovací běh. Pokud chcete toto upozornění potlačit, použijte parametr /InIsolation.
ko: 유효 플랫폼 {0} 및 .NET Framework {1} 설정에서 테스트 실행에 요구하는 대로 격리 모드를 사용하여 테스트를 실행합니다. 이 경고를 표시하지 않으려면 /inIsolation 매개 변수를 사용하세요.
zh_hans: 按照针对测试运行有效的 Platform:{0} 和 .Net Framework:{1} 设置要求，使用隔离模式运行测试。使用 /inIsolation 参数取消此警告。

# FrameworkArgumentHelp
source: --Framework|/Framework:<Framework Version> Target .Net Framework version to be used for test execution. Valid values are ".NETFramework,Version=v4.5.1", ".NETCoreApp,Version=v1.0" etc. Other supported values are Framework40, Framework45, FrameworkCore10 and FrameworkUap10.
cs: --Framework|/Framework:<verze rozhraní> Cílová verze rozhraní .NET Framework, která se použije ke spuštění testu. Platné hodnoty jsou .NETFramework,Version=v4.5.1, .NETCoreApp,Version=v1.0 apod. Další podporované hodnoty jsou Framework40, Framework45, FrameworkCore10 a FrameworkUap10.
ko: --Framework|/Framework:<Framework Version> 테스트 실행에 사용할 대상 .NET Framework 버전입니다. 유효한 값은 ".NETFramework,Version=v4.5.1", ".NETCoreApp,Version=v1.0" 등입니다. 기타 지원되는 값은 Framework40, Framework45, FrameworkCore10 및 FrameworkUap10입니다.
zh_hans: --Framework|/Framework:<Framework Version> 用于执行测试的目标 .Net Framework 版本。 有效值为 ".NETFramework,Version=v4.5.1".NETCoreApp,Version=v1.0" 等。 其他支持的值为 Framework40、Framework45、FrameworkCore10 和 FrameworkUap10。

# FrameworkVersionRequired
source: The /Framework argument requires the target .Net Framework version for the test run. Example: /Framework:".NETFramework,Version=v4.5.1"
cs: Argument /Framework vyžaduje cílovou verzi rozhraní .NET Framework pro testovací běh. Příklad: /Framework:".NETFramework,Version=v4.5.1"
ko: /Framework 인수에는 테스트 실행의 대상 .NET Framework 버전이 필요합니다. 예: /Framework:".NETFramework,Version=v4.5.1"
zh_hans: /Framework 参数要求用于测试运行的目标 .Net Framework 版本。示例: /Framework:".NETFramework,Version=v4.5.1"

# InvalidFrameworkVersion
source: Invalid .Net Framework version:{0}. Please give the fullname of the TargetFramework(Example: .NETCoreApp,Version=v2.0). Other supported .Net Framework versions are Framework40, Framework45, FrameworkCore10 and FrameworkUap10.
cs: Neplatná verze rozhraní .NET Framework: {0}. Zadejte prosím úplný název cílového rozhraní (příklad: .NETCoreApp,Version=v2.0). Další podporované verze jsou Framework40, Framework45, FrameworkCore10 a FrameworkUap10.
ko: .NET Framework 버전 {0}이(가) 잘못되었습니다. TargetFramework의 전체 이름을 지정하세요(예: .NETCoreApp,Version=v2.0). 지원되는 다른 .NET Framework 버전은 Framework40, Framework45, FrameworkCore10 및 FrameworkUap10입니다.
zh_hans: 无效的 .Net Framework 版本: {0}。请提供 TargetFramework 的全名(示例: .NETCoreApp,Version=v2.0)。其他支持的 .Net Framework 版本为 Framework40、Framework45、FrameworkCore10 和 FrameworkUap10。

# AppContainerTestPrerequisiteFail
source: Could not start test run for unit tests for Windows Store app: {0}.
cs: Nepovedlo se spustit testovací běh pro testy jednotek aplikace pro Windows Store: {0}
ko: Windows 스토어 앱에 대한 단위 테스트의 테스트 실행을 시작할 수 없습니다. {0}.
zh_hans: 无法启动针对 Windows 应用商店应用的单元测试的测试运行: {0}。
