Repository: yourcontractservice/vstest
Catalog: src/vstest.console/Resources/xlf/Resources.*.xlf
Languages: cs, ko, zh_hans

# ResultsDirectoryValueRequired
source: The /ResultsDirectory parameter requires a value, where the test results should be saved. Example: /ResultsDirectory:c:\MyTestResultsDirectory
cs: Parametr /ResultsDirectory vyžaduje hodnotu určující, kam se výsledky testů uloží. Příklad: /ResultsDirectory:c:\MůjAdresářVýsledkůTestů
ko: /ResultsDirectory 매개 변수에는 테스트 결과가 저장되어야 하는 값이 필요합니다. 예: /ResultsDirectory:c:\MyTestResultsDirectory
zh_hans: /ResultsDirectory 参数需要一个值，应在其中保存测试结果。例如: /ResultsDirectory:c:\MyTestResultsDirectory

# InvalidResultsDirectoryPathCommand
source: The path '{0}' specified in the 'ResultsDirectory' is invalid. Error: {1}
cs: Cesta {0} zadaná v ResultsDirectory není platná. Chyba: {1}
ko: 'ResultsDirectory'에 지정된 경로 '{0}'이(가) 잘못되었습니다. 오류: {1}
zh_hans: “ResultsDirectory”中指定的路径“{0}”无效。错误: {1}

# InIsolationDeprecated
source: The /InIsolation flag is deprecated. The tests are always run in a separate process
cs: Příznak /InIsolation je zastaralý. Testy se vždy spouští v samostatném procesu.
ko: /InIsolation 플래그는 사용되지 않습니다. 테스트는 항상 별도의 프로세스에서 실행됩니다.
zh_hans: /InIsolation 标志已弃用。测试始终在单独的进程中运行

# NotRunTestIndicator
source: Not Run {0}
cs: Nespuštěno: {0}
ko: {0} 실행 안 함
zh_hans: 未运行 {0}

# VstestDiagLogOutputPath
source: Logging Vstest Diagnostics in file: {0}
cs: Protokolování diagnostiky Vstest v souboru: {0}
ko: 파일에 Vstest Diagnostics 로깅 중: {0}
zh_hans: 在文件 {0} 中记录 Vstest 诊断

# CollectArgumentHelp
source: --Collect|/Collect:<DataCollector FriendlyName> Enables data collector for the test run. More info here : https://aka.ms/vstest-collect
cs: --Collect|/Collect:<DataCollector FriendlyName> Povolit kolekci dat pro testovací běh. Další informace: https://aka.ms/vstest-collect
ko: --Collect|/Collect:<DataCollector FriendlyName> 테스트 실행을 위해 데이터 수집기를 사용하도록 설정합니다. 자세한 내용은 https://aka.ms/vstest-collect를 참조하세요.
zh_hans: --Collect|/Collect:<DataCollector FriendlyName> 启用数据收集器以运行测试。可在此处获取详细信息: https://aka.ms/vstest-collect

# DataCollectorFriendlyNameInvalid
source: The Data Collector friendly name '{0}' is not valid. The Data Collector will be ignored.
cs: Popisný název kolekce dat {0} není platný. Kolekce dat se bude ignorovat.
ko: 데이터 수집기 이름 '{0}'이(가) 잘못되었습니다. 데이터 수집기가 무시됩니다.
zh_hans: 数据收集器友好名称“{0}”无效。将忽略数据收集器。

# DbgTrcMessagesBanner
source: Debug Traces Messages:
cs: Zprávy trasování ladění:
ko: 디버그 추적 메시지:
zh_hans: 调试跟踪消息:

# EnableBlameUsage
source: --Blame|/Blame:[CollectDump];[CollectAlways]=[Value];[DumpType]=[Value] Runs the test in blame mode. This option is helpful in isolating the problematic test causing test host crash. It creates an output file in the current directory as "Sequence.xml", that captures the order of execution of test before the crash. You may optionally choose to collect process dump for the test host. When you choose to collect dump, by default, a mini dump will be collected on a crash. You may also choose to override this default behaviour by some optional parameters: CollectAlways - To collect dump on exit even if there is no crash (true/false) DumpType - To specify dump type (mini/full). Example: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full
cs: --Blame|/Blame:[CollectDump];[CollectAlways]=[Value];[DumpType]=[Value] Spustí test v režimu blame. Tato možnost je užitečná při izolaci problematického testu, který způsobuje jeho chybové ukončení. Vytvoří výstupní soubor v aktuálním adresáři jako Sequence.xml, který zachytí pořadí provádění testu před chybovým ukončením. Volitelně se můžete rozhodnout pro shromáždění výpisu procesu pro hostitele testu. Pokud se rozhodnete pro shromáždění výpisu, shromáždí se ve výchozím nastavení při chybovém ukončení minivýpis. Toto výchozí chování můžete také přepsat pomocí určitých volitelných parametrů: CollectAlways – Pro shromáždění výpisu při ukončení, pokud nedojde k chybovému ukončení (true/false) DumpType – Pro zadání typu výpisu (mini/full) Příklad: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full
ko: --Blame|/Blame:[CollectDump];[CollectAlways]=[Value];[DumpType]=[Value] 원인 모드에서 테스트를 실행합니다. 이 옵션은 테스트 호스트 크래시를 유발하는 문제 있는 테스트를 격리하는 데 유용합니다. 이 경우 현재 디렉터리에 "Sequence.xml"라는 출력 파일을 만들며, 이 파일에는 크래시 이전 테스트 실행 순서가 캡처되어 있습니다. 필요에 따라 테스트 호스트에 대한 프로세스 덤프를 수집하도록 선택할 수 있습니다. 덤프를 수집하도록 선택하는 경우 기본적으로 크래시에 대한 미니 덤프가 수집됩니다. 다음과 같은 몇 가지 선택적 매개 변수로 이 기본 동작을 재정의하도록 선택할 수도 있습니다. CollectAlways - 크래시가 없는 경우에도 종료 시 덤프를 수집함(true/false) DumpType - 덤프 유형을 지정함(mini/full). 예: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full
zh_hans: --Blame|/Blame:[CollectDump];[CollectAlways]=[Value];[DumpType]=[Value] 在追责模式下运行测试。此选项有助于隔离导致测试主机崩溃的问题测试。 它会在当前目录中创建一个输出文件 "Sequence.xml"， 用于在崩溃之前捕获测试的执行顺序。 可以根据需要选择收集测试主机的进程转储。 选择收集转储时，默认情况下，将在崩溃时收集小型转储。 还可选择通过一些可选参数覆盖此默认行为: CollectAlways - 若无崩溃则在退出时收集转储(true/false) DumpType - 指定转储类型(小型/完整)。 Example: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full

source: Test Run Aborted.
cs: Testovací běh se přerušil.
ko: 테스트 실행이 중단되었습니다.
zh_hans: 测试运行已中止。

source: Test Run Canceled.
cs: Testovací běh se zrušil.
ko: 테스트 실행이 취소되었습니다.
zh_hans: 测试运行已取消。

# OpenResponseFileError
source: Error opening response file '{0}'
cs: Chyba při otevírání souboru odpovědí {0}
ko: 지시 파일 '{0}'을(를) 여는 중 오류가 발생했습니다.
zh_hans: 打开响应文件“{0}”时出错

# ResponseFileArgumentHelp
source: @<file> Read response file for more options.
cs: @<file> Načte další možnosti ze souboru odpovědí.
ko: @<file> 추가 옵션에 대한 지시 파일을 읽습니다.
zh_hans: @<file> 有关更多选项，请阅读响应文件。

# TestRunSummaryForCanceledOrAbortedRun
source: Total tests: Unknown
cs: Celkový počet testů: neznámý
ko: 총 테스트 수: 알 수 없음
zh_hans: 测试总数: 未知

# SuggestTestAdapterPathIfNoTestsIsFound
source: Additionally, path to test adapters can be specified using /TestAdapterPath command. Example /TestAdapterPath:<pathToCustomAdapters>.
cs: Kromě toho se cesta k adaptérům testů dá zadat pomocí příkazu /TestAdapterPath. Příklad: /TestAdapterPath:<cesta_k_vlastním_adaptérům>.
ko: 또한 테스트 어댑터의 경로는 /TestAdapterPath 명령을 사용하여 지정할 수 있습니다. 예: /TestAdapterPath:<pathToCustomAdapters>.
zh_hans: 此外，还可以使用 /TestAdapterPath 命令指定测试适配器的路径。示例 /TestAdapterPath:<pathToCustomAdapters>。

# UseVsixExtensionsDeprecation
source: /UseVsixExtensions is getting deprecated. Please use /TestAdapterPath instead.
cs: Příkaz /UseVsixExtensions je zastaralý. Použijte místo něj prosím příkaz /TestAdapterPath.
ko: /UseVsixExtensions는 더 이상 사용되지 않습니다. 대신 /TestAdapterPath를 사용하세요.
zh_hans: /UseVsixExtensions 即将被弃用。请改为使用 /TestAdapterPath。

# DisableAutoFakesUsage
source: --DisableAutoFakes|/DisableAutoFakes:<true/false> Example: /DisableAutoFakes:true
cs: --DisableAutoFakes|/DisableAutoFakes:<true/false> Příklad: /DisableAutoFakes:true
ko: --DisableAutoFakes|/DisableAutoFakes:<true/false> 예: /DisableAutoFakes:true
zh_hans: --DisableAutoFakes|/DisableAutoFakes:<true/false> 示例: /DisableAutoFakes:true

# CollectWithTestSettingErrorMessage
source: --Collect|/Collect:"{0}" is not supported if test run is configured using testsettings.
cs: --Collect|/Collect:"{0}" není podporován, pokud je testovací běh nakonfigurován pomocí nastavení testů.
ko: --Collect|/Collect:testsettings를 사용하여 테스트 실행을 구성하는 경우 "{0}"은(는) 지원되지 않습니다.
zh_hans: --Collect|/如果使用测试设置配置了测试运行，则不支持收集:“{0}”。

# RunsettingsWithDCErrorMessage
source: Data collectors other than Code Coverage and Microsoft Fakes configured via run settings are not supported with embedded test settings. Please see https://aka.ms/vstest-configure-datacollector for more information. Run settings: {0}.
cs: Kolekce dat jiné než Pokrytí kódu a Microsoft Fakes konfigurované prostřednictvím nastavení běhu nejsou podporované s vloženým nastavením testů. Další informace viz https://aka.ms/vstest-configure-datacollector. Nastavení běhu: {0}
ko: 실행 설정을 통해 구성된 코드 검사 및 Microsoft Fakes 이외의 데이터 수집기는 포함된 테스트 설정으로는 지원되지 않습니다. 자세한 내용은 https://aka.ms/vstest-configure-datacollector를 참조하세요. 실행 설정: {0}.
zh_hans: 除通过运行设置配置的代码覆盖率和 Microsoft Fakes 之外，嵌入测试设置不支持其他数据收集器。请参阅 https://aka.ms/vstest-configure-datacollector 了解详细信息。运行测试: {0}。

# EnableLoggerArgumentsInNetCore
source: --logger|/logger:<Logger Uri/FriendlyName> Specify a logger for test results. For example, to log results into a Visual Studio Test Results File (TRX) use /logger:trx[;LogFileName=<Defaults to unique file name>] Creates file in TestResults directory with given LogFileName. Change the verbosity level in log messages for console logger as shown below Example: /logger:console;verbosity=<Defaults to "minimal"> Allowed values for verbosity: quiet, minimal, normal and detailed. Change the diagnostic level prefix for console logger as shown below Example: /logger:console;prefix=<Defaults to "false"> More info on Console Logger here : https://aka.ms/console-logger
cs: --logger|/logger:<identifikátor URI nebo popisný název protokolovacího nástroje> Určuje protokolovací nástroj pro výsledky testu. Pokud chcete protokolovat výsledky třeba do souboru výsledků testu sady Visual Studio (TRX), použijte /logger:trx[;LogFileName=<výchozí hodnota je jedinečný název souboru>] Vytvoří soubor v adresáři TestResults s daným LogFileName. Změní úroveň podrobností ve zprávách protokolu pro protokolovací nástroj konzoly tak, jak je uvedeno níže. Příklad: /logger:console;verbosity=<výchozí hodnota je minimal> Povolené hodnoty pro verbosity: quiet, minimal, normal a detailed Změní předponu úrovně diagnostiky pro protokolovací nástroj konzoly tak, jak je uvedeno níže. Příklad: /logger:console;prefix=<výchozí hodnota je false> Další informace o protokolovacím nástroji konzoly: https://aka.ms/console-logger
ko: --logger|/logger:<Logger Uri/FriendlyName> 테스트 결과의 로거를 지정합니다. 예를 들어 Visual Studio TRX(테스트 결과 파일)에 결과를 기록하려면 /logger:trx[;LogFileName=<Defaults to unique file name>]를 사용합니다. 지정된 LogFileName으로 TestResults 디렉터리에서 파일을 만듭니다. 아래 표시된 대로 콘솔 로거에 대한 로그 메시지에서 세부 정보 표시 수준을 변경합니다. 예: /logger:console;verbosity=<Defaults to "minimal"> 허용된 세부 정보 표시 값: quiet, minimal, normal 및 detailed. 아래 표시된 대로 콘솔 로거에 대한 진단 수준 접두사를 변경합니다. 예: /logger:console;prefix=<Defaults to "false"> 콘솔 로거에 대한 자세한 내용은 https://aka.ms/console-logger를 참조하세요.
zh_hans: --logger|/logger:<Logger Uri/FriendlyName> 为测试结果指定一个记录器。例如，若要将结果记录到 Visual Studio 测试结果文件(TRX)中，请使用 /logger:trx[;LogFileName=<Defaults to unique file name>] 使用给定的 LogFileName 在 TestResults 目录中创建文件。 更改控制台记录器的日志消息中的详细程度，如下所示 示例: /logger:console;verbosity=<Defaults to "minimal"> 允许的详细程度的值: quiet、minimal、normal 和 detailed。 更改控制台记录器的诊断级别前缀，如下所示 示例: /logger:console;prefix=<Defaults to "false"> 此处为控制台记录器的详细信息: https://aka.ms/console-logger

# BlameCollectDumpNotSupportedForPlatform
source: CollectDump option for Blame is not supported for this platform.
cs: Možnost CollectDump pro Blame není pro tuto platformu podporovaná.
ko: Blame에 대한 CollectDump 옵션이 이 플랫폼에서 지원되지 않습니다.
zh_hans: 此平台不支持用于追责的 CollectDump 选项。

# BlameIncorrectOption
source: The blame parameter specified with blame, {0} is invalid. Ignoring this parameter.
cs: Zadaný parametr blame {0} není platný. Tento parametr se bude ignorovat.
ko: blame으로 지정된 blame 매개 변수 {0}이(가) 잘못되었습니다. 이 매개 변수를 무시합니다.
zh_hans: 追责时指定的追责参数 {0} 无效。忽略此参数。

# InvalidDiagFilePath
source: Diag file path '{0}' is not valid.
cs: Cesta k souboru diag {0} není platná.
ko: Diag 파일 경로 '{0}'이(가) 잘못되었습니다.
zh_hans: 诊断文件路径“{0}”无效。

# InvalidBlameArgument
source: Blame argument '{0}' is not valid.
cs: Argument blame {0} není platný.
ko: Blame 인수 '{0}'이(가) 잘못되었습니다.
zh_hans: 追责参数“{0}”无效。

# InvalidDiagArgument
source: Diag argument '{0}' is not valid.
cs: Argument diag {0} není platný.
ko: Diag 인수 '{0}'이(가) 잘못되었습니다.
zh_hans: 诊断参数“{0}”无效。

# InvalidLoggerArgument
source: Logger argument '{0}' is not valid.
cs: Argument logger {0} není platný.
ko: Logger 인수 '{0}'이(가) 잘못되었습니다.
zh_hans: 记录器参数“{0}”无效。

# Framework35NotSupported
source: Framework35 is not supported. For projects targeting .Net Framework 3.5, test will run in CLR 4.0 "compatibility mode".
cs: Rozhraní Framework35 není podporováno. Pro projekty, které cílí na rozhraní .Net Framework 3.5, bude test spuštěn v „režimu kompatibility“ CLR 4.0.
ko: Framework35가 지원되지 않습니다. .NET Framework 3.5를 대상으로 하는 프로젝트의 경우 테스트가 CLR 4.0 "호환 모드"에서 실행됩니다.
zh_hans: 不支持 Framework35。对于面向 .Net Framework 3.5 的项目，将在 CLR 4.0“兼容性模式”中运行测试。

# ProgressIndicatorString
source: Test run in progress
cs: Probíhá testovací běh
ko: 테스트 실행 중
zh_hans: 正在运行测试

# TestRunSummaryTotalTests
source: Total tests: {0}
cs: Celkový počet testů: {0}
ko: 총 테스트 수: {0}
zh_hans: 测试总数: {0}

# TestRunSummaryFailedTests
source: Failed: {0}
cs: Neúspěšné: {0}
ko: 실패: {0}
zh_hans: 失败数: {0}

# TestRunSummaryPassedTests
source: Passed: {0}
cs: Úspěšné: {0}
ko: 통과: {0}
zh_hans: 通过数: {0}

# TestRunSummarySkippedTests
source: Skipped: {0}
cs: Přeskočené: {0}
ko: 건너뜀: {0}
zh_hans: 跳过数: {0}

# InvalidArgument
source: The argument {0} is invalid. Please use the /help option to check the list of valid arguments.
cs: Argument {0} není platný. Pokud si chcete zobrazit seznam platných argumentů, použijte prosím možnost /help.
ko: {0} 인수가 잘못되었습니다. /help 옵션을 사용하여 유효한 인수 목록을 확인하세요.
zh_hans: 参数 {0} 无效。请使用 /help 选项检查有效参数的列表。

# TestSourcesDiscovered
source: A total of {0} test files matched the specified pattern.
cs: Celkový počet testovacích souborů, které odpovídají zadanému vzoru: {0}
ko: 지정된 패턴과 일치한 총 테스트 파일 수는 {0}개입니다.
zh_hans: 总共 {0} 个测试文件与指定模式相匹配。

# InvalidTestRunParameterArgument
source: The test run parameter argument '{0}' is invalid. Please use the format below. Format: TestRunParameters.Parameter(name=\"<name>\", value=\"<value>\")
cs: Argument parametru testovacího běhu {0} není platný. Použijte prosím formát uvedený níže. Formát: TestRunParameters.Parameter(name=\"<name>\", value=\"<value>\")
ko: 테스트 실행 매개 변수 인수 '{0}'이(가) 잘못되었습니다. 아래 형식을 사용하세요. 형식: TestRunParameters.Parameter(name=\"<name>\", value=\"<value>\")
zh_hans: 测试运行参数自变量“{0}”无效。请使用以下格式。 格式: TestRunParameters.Parameter(name=\"<name>\", value=\"<value>\")
