Repository: yourcontractservice/vstest
Catalog: src/vstest.console/Resources/xlf/Resources.*.xlf
Languages: cs, ko, zh_hans

# TestCaseFilterArgumentHelp
source: --TestCaseFilter|/TestCaseFilter:<Expression> Run tests that match the given expression. <Expression> is of the format <property>Operator<value>[|&<Expression>] where Operator is one of =, != or ~ (Operator ~ has 'contains' semantics and is applicable for string properties like DisplayName). Parenthesis () can be used to group sub-expressions. Examples: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nightly |Name=MyTestMethod)"
cs: --TestCaseFilter|/TestCaseFilter:<výraz> Spustí testy, které odpovídají danému výrazu. <výraz> musí být formátu <vlastnost>operátor<hodnota>[|&<výraz>], kde operátor je =, != nebo ~ (operátor ~ má sémantiku contains a je použitelný na vlastnosti řetězce, jako je DisplayName). Závorky () mohou být použity pro seskupení podvýrazů. Příklady: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nightly |Name=MyTestMethod)"
ko: --TestCaseFilter|/TestCaseFilter:<Expression> 지정된 식과 일치하는 테스트를 실행합니다. <Expression>은 <property>연산자<value>[|&<Expression>] 형식이며, 여기서 연산자는 =, !=, ~ 중 하나입니다(~ 연산자는 '포함' 의미 체계를 사용하며 DisplayName 같은 문자열 속성에 적용됩니다). 괄호 ()를 사용하여 하위 식을 그룹화할 수 있습니다. 예: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nightly |Name=MyTestMethod)"
zh_hans: --TestCaseFilter|/TestCaseFilter:<Expression> 运行与给定表达式匹配的测试。 <Expression> 的格式为 <property>Operator<value>[|&<Expression>] 其中，Operator 是 =、!= 或 ~ (Operator ~ 具有 "contains" 语义且适用于诸如 DisplayName 之类的字符串属性)。 括号()可用于对子表达式进行分组。 示例: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nightly |Name=MyTestMethod)"

# TestCaseFilterValueRequired
source: The /TestCaseFilter argument requires the filter value. Filter value can be <property>=<value> type. Examples: "Priority=1", "TestCategory=Nightly"
cs: Argument příkazu /TestCaseFilter vyžaduje hodnotu filtru. Hodnota filtru by měla být typu<vlastnost>=<hodnota>. Příklady: "Priority=1", "TestCategory=Nightly"
ko: /TestCaseFilter 인수에는 필터 값이 필요합니다. 필터 값은 <property>=<value> 형식이 될 수 있습니다. 예: "Priority=1", "TestCategory=Nightly"
zh_hans: /TestCaseFilter 参数需要筛选器值。 筛选器值可以是“<属性>=<值>”类型。 示例: "Priority=1", "TestCategory=Nightly"

# InvalidTestCaseFilterValueForSpecificTests
source: The /TestCaseFilter argument cannot be specified with /Tests. Filtering of test cases is not applicable when tests are specified.
cs: Argument /TestCaseFilter nejde zadat spolu s argumentem /Tests. Když se zadají testy, filtrování testovacích případů nejde použít.
ko: /TestCaseFilter 인수는 /Tests로 지정할 수 없습니다. 테스트가 지정된 경우 테스트 사례 필터링은 적용할 수 없습니다.
zh_hans: 不能使用 /Tests 指定 /TestCaseFilter 参数。指定测试时无法筛选测试用例。

# NonDefaultFrameworkAndOrArchDetected
source: {0} is built for {1}/{2}. The test assemblies specified in a run should have a common target .Net framework and platform.
cs: Projekt {0} je sestavený pro {1}/{2}. Testovací sestavení zadané v běhu by měly mít společné cílové rozhraní .NET Framework a platformu.
ko: {0}은(는) {1}/{2}에 대해 빌드됩니다. 실행 중에 지정된 테스트 어셈블리는 공통 대상 .NET Framework와 플랫폼을 사용해야 합니다.
zh_hans: {0} 为 {1}/{2} 而生成。运行中指定的测试程序集应具有共有的目标.Net Framework 和平台。

# RunSingleAppContainerSource
source: Only one app package (.appx file) can be specified for running tests.
cs: Pro spouštění testů se dá zadat jenom jeden balíček aplikace (soubor .appx).
ko: 테스트 실행을 위해 하나의 app 패키지(.appx file)만 지정할 수 있습니다.
zh_hans: 只能为运行测试指定一个应用包(.appx 文件)。

# StartingDiscovery
source: Starting test discovery, please wait...
cs: Začínají se zjišťovat testy, počkejte prosím...
ko: 테스트 검색을 시작하는 중입니다. 잠시 기다려 주세요...
zh_hans: 正在启动测试发现，请稍候...

# StartingExecution
source: Starting test execution, please wait...
cs: Začínají se provádět testy, počkejte prosím...
ko: 테스트 실행을 시작하는 중입니다. 잠시 기다려 주세요...
zh_hans: 正在启动测试执行，请稍候...

# DisablingDCOnExceptionWhileParsingDCInfo
source: Reading diagnostic data adapter settings threw an running '{0}'. All diagnostic data adapters will be skipped in this run.
cs: Při čtení nastavení adaptéru diagnostických dat se vyvolala výjimka {0}. Všechny adaptéry diagnostických dat se v tomto běhu přeskočí.
ko: 진단 데이터 어댑터 설정을 읽는 중에 실행 중인 '{0}'이(가) throw되었습니다. 이 실행에서 모든 진단 데이터 어댑터를 건너뜁니다.
zh_hans: 读取诊断数据适配器设置引发了“{0}”的运行。将在此运行中跳过所有诊断数据适配器。

# EnableCodeCoverageArgumentProcessorHelp
source: /EnableCodeCoverage Enables data collector 'CodeCoverage' for the test run.
cs: /EnableCodeCoverage Povolí kolekci dat CodeCoverage pro testovací běh.
ko: /EnableCodeCoverage 테스트 실행에 대해 데이터 수집기 'CodeCoverage'를 사용하도록 설정합니다.
zh_hans: /EnableCodeCoverage 启动数据收集器“CodeCoverage”以运行测试。

# InvalidEnableCodeCoverageCommand
source: Argument {0} is not expected in the 'EnableCodeCoverage' command. Specify the command without the argument (Example: vstest.console.exe myTests.dll /EnableCodeCoverage) and try again.
cs: V příkazu EnableCodeCoverage se argument {0} neočekává. Zadejte příkaz bez tohoto argumentu (třeba vstest.console.exe myTests.dll /EnableCodeCoverage) a zkuste to znovu.
ko: 'EnableCodeCoverage' 명령에는 {0} 인수가 필요하지 않습니다. 인수 없이 명령을 지정한 다음(예: vstest.console.exe myTests.dll /EnableCodeCoverage) 다시 시도하세요.
zh_hans: 参数 {0} 不应出现在 "EnableCodeCoverage" 命令中。指定不带参数的命令(示例: vstest.console.exe myTests.dll /EnableCodeCoverage)，然后重试。

# NoTestEntryPoint
source: App package '{0}' does not has test executor entry point. For running unit tests for Windows Store apps, create app package using Windows Store app Unit Test Library project.
cs: Balíček aplikace {0} nemá vstupní bod prováděcího modulu testování. Pokud chcete spouštět testy jednotek pro aplikace pro Windows Store, vytvořte balíček aplikace pomocí projektu Knihovna testu jednotek pro aplikaci pro Windows Store.
ko: 앱 패키지 '{0}'에 테스트 Executor 진입점이 없습니다. Windows 스토어 앱에 대한 단위 테스트를 실행하려면 Windows 스토어 앱 단위 테스트 라이브러리 프로젝트를 사용하여 앱 패키지를 만드세요.
zh_hans: 应用包“{0}”没有测试执行器入口点。为对 Windows 应用商店应用运行单元测试，使用 Windows 应用商店应用单元测试库项目创建应用包。

# DisablingCodeCoverageInAppContainerTestExecution
source: Code coverage is not available for Windows Store apps. Code coverage analysis skipped for this test run.
cs: Pro aplikace pro Windows Store není pokrytí kódu k dispozici. Pro tento testovací běh se analýza pokrytí kódu přeskočí.
ko: Windows 스토어 앱에서는 코드 검사를 사용할 수 없습니다. 이 테스트 실행에 대해 코드 검사 분석을 건너뛰었습니다.
zh_hans: 代码覆盖率不适用于 Windows 应用商店应用。已对此测试运行跳过代码覆盖率分析。

# SomeTestsUnavailableAfterFiltering
source: A total of {0} tests were discovered but some tests do not match the specified selection criteria({1}). Use right value(s) and try again.
cs: Zjistilo se několik testů (celkem {0}), ale některé z testů neodpovídají zadaným kritériím výběru ({1}). Použijte správné hodnoty a zkuste to znovu.
ko: 총 {0}개의 테스트가 검색되었지만 일부 테스트는 지정된 선택 기준({1})과 일치하지 않습니다. 올바른 값을 사용하여 다시 시도하세요.
zh_hans: 共发现 {0} 个测试，但一些测试与指定选择条件 ({1}) 不匹配。使用正确的值，然后重试。

# TestAdapterPathHelp
source: --TestAdapterPath|/TestAdapterPath This makes vstest.console.exe process use custom test adapters from a given path (if any) in the test run. Example /TestAdapterPath:<pathToCustomAdapters>
cs: --TestAdapterPath|/TestAdapterPath Proces vstest.console.exe použije v testovacím běhu vlastní adaptéry testu ze zadané cesty (pokud existují). Příklad: /TestAdapterPath:<cesta_k_vlastním_adaptérům>
ko: --TestAdapterPath|/TestAdapterPath 이 옵션을 사용하면 vstest.console.exe 프로세스가 테스트 실행 시 지정된 경로(있는 경우)에서 사용자 지정 테스트 어댑터를 사용합니다. 예: /TestAdapterPath:<pathToCustomAdapters>
zh_hans: --TestAdapterPath|/TestAdapterPath 这将使 vstest.console.exe 进程在测试运行中使用 给定路径(如果有)中的自定义测试适配器。 示例 /TestAdapterPath:<pathToCustomAdapters>

# TestAdapterPathValueRequired
source: The /TestAdapterPath parameter requires a value, which is path of a location containing custom test adapters. Example: /TestAdapterPath:c:\MyCustomAdapters
cs: Parametr /TestAdapterPath vyžaduje hodnotu, která je součástí umístění obsahujícího vlastní adaptéry testů. Příklad: /TestAdapterPath:c:\MojeVlastniAdaptery
ko: /TestAdapterPath 매개 변수에는 사용자 지정 테스트 어댑터가 포함된 위치의 일부인 값이 필요합니다. 예: /TestAdapterPath:c:\MyCustomAdapters
zh_hans: /TestAdapterPath 参数需要一个值，该值是自定义测试适配器所在位置的路径。示例: /TestAdapterPath:c:\MyCustomAdapters

# InvalidTestAdapterPathCommand
source: The path '{0}' specified in the 'TestAdapterPath' is invalid. Error: {1}
cs: Cesta {0} zadaná v TestAdapterPath není platná. Chyba: {1}
ko: 'TestAdapterPath'에 지정된 경로 '{0}'이(가) 잘못되었습니다. 오류: {1}
zh_hans: "TestAdapterPath" 中指定的路径“{0}”无效。错误: {1}

# TestAdapterPathDoesNotExist
source: The custom test adapter search path provided was not found, provide a valid path and try again.
cs: Zadaná cesta pro vyhledávání vlastních adaptérů testů se nenašla. Zadejte platnou cestu a zkuste to znovu.
ko: 제공한 사용자 지정 테스트 어댑터 검색 경로를 찾을 수 없습니다. 올바른 경로를 제공하고 다시 시도하세요.
zh_hans: 找不到提供的自定义测试适配器搜索路径，请提供一个有效路径，然后重试。

# NoAdaptersFoundInTestAdapterPath
source: The path '{0}' specified in the 'TestAdapterPath' does not contain any test adapters, provide a valid path and try again.
cs: Cesta {0} zadaná v TestAdapterPath neobsahuje žádné adaptéry testů. Zadejte platnou cestu a zkuste to znovu.
ko: 'TestAdapterPath'에 지정된 경로 '{0}'에 테스트 어댑터가 포함되지 않습니다. 올바른 경로를 제공하고 다시 시도하세요.
zh_hans: "TestAdapterPath" 中指定的路径“{0}”不包含任何测试适配器，请提供有效路径，然后重试。

# PhoneAppContainerTestPrerequisiteFail
source: Could not start test run for the tests for Windows Phone app: {0}.
cs: Nepovedlo se spustit testovací běh pro testy aplikace pro Windows Phone: {0}
ko: Windows Phone 앱 {0}에 대한 테스트를 위해 테스트 실행을 시작할 수 없습니다.
zh_hans: 无法启动针对 Windows Phone 应用的测试的测试运行: {0}。

# SwitchToIsolationInPhoneAppContainerMode
source: Using Isolation mode to run unit tests for Windows Phone apps. Use the /InIsolation parameter to suppress this warning.
cs: Ke spouštění testů jednotek pro aplikace pro Windows Phone se používá režim izolace. Pokud chcete toto upozornění potlačit, použijte parametr /InIsolation.
ko: 격리 모드를 사용하여 Windows Phone 앱에 대한 단위 테스트를 실행합니다. 이 경고를 표시하지 않으려면 /InIsolation 매개 변수를 사용하세요.
zh_hans: 使用隔离模式为 Windows Phone 应用运行单元测试。使用 /InIsolation 参数取消此警告。

# DisablingCodeCoverageInPhoneAppContainerTestExecution
source: Code coverage is not available for Windows Phone apps. Code coverage analysis skipped for this test run.
cs: Pro aplikace pro Windows Phone není pokrytí kódu k dispozici. Pro tento testovací běh se analýza pokrytí kódu přeskočí.
ko: Windows Phone 앱에서는 코드 검사를 사용할 수 없습니다. 이 테스트 실행에 대해 코드 검사 분석을 건너뛰었습니다.
zh_hans: 代码覆盖率不适用于 Windows Phone 应用。已为此测试运行跳过代码覆盖率分析。

# DisablingDataCollectionInPhoneAppContainerTestExecution
source: Diagnostic data adapters are not supported when running unit tests for Windows Phone apps. Remove diagnostic data adapters settings from settings.
cs: Pokud se spouští testy jednotek pro aplikace pro Windows Phone, nepodporují se adaptéry diagnostických dat. Odeberte nastavení adaptérů diagnostických dat z nastavení.
ko: Windows Phone 앱에 대한 단위 테스트를 실행할 때는 진단 데이터 어댑터가 지원되지 않습니다. 설정에서 진단 데이터 어댑터 설정을 제거하세요.
zh_hans: 为 Windows Phone 应用运行单元测试时不支持诊断数据适配器。从设置中删除诊断数据适配器设置。

# PhoneNoTestEntryPoint
source: App package '{0}' does not has test executor entry point. For running unit tests for Windows Phone apps, create app package using Windows Phone Unit Test App project.
cs: Balíček aplikace {0} nemá vstupní bod prováděcího modulu testování. Pokud chcete spouštět testy jednotek pro aplikace pro Windows Phone, vytvořte balíček aplikace pomocí projektu Knihovna testu jednotek pro aplikaci pro Windows Phone.
ko: 앱 패키지 '{0}'에 테스트 Executor 진입점이 없습니다. Windows Phone 앱에 대한 단위 테스트를 실행하려면 Windows Phone 앱 단위 테스트 앱 프로젝트를 사용하여 앱 패키지를 만드세요.
zh_hans: 应用包“{0}”没有测试执行器入口点。为对 Windows Phone 应用运行单元测试，使用 Windows Phone 应用单元测试应用项目创建应用包。

# TestSettingsFrameworkMismatch
source: Using framework {0} to run the tests. Specify /Framework:{1} to suppress this warning.
cs: Ke spouštění testů se používá rozhraní {0}. Pokud chcete toto upozornění potlačit, zadejte /Framework:{1}.
ko: {0} 프레임워크를 사용하여 테스트를 실행합니다. 이 경고가 표시되지 않게 하려면 /Framework:{1}을(를) 지정하세요.
zh_hans: 使用框架 {0} 运行测试。指定 /Framework:{1} 取消此警告。

# AppxBundleSourceWarning
source: No test found in the specified test containers. Additionally, Microsoft Windows Store Unit test adapter does not support .appxbundle files. Create an appx (set Generate App bundle option to Never) when creating App Package and try again.
cs: V kontejnerech testů se nenašly žádné testy. Navíc Adaptér testování částí aplikací pro Microsoft Windows Store nepodporuje soubory .appxbundle. Při vytváření balíčku aplikace vytvořte soubor appx (nastavte možnost Generovat svazek aplikací na Nikdy) a zkuste to znovu.
ko: 지정한 테스트 컨테이너에 테스트가 없습니다. 또한 Microsoft Windows 스토어 단위 테스트 어댑터에서 .appxbundle 파일을 지원하지 않습니다. 앱 패키지를 만들 때는 appx를 생성([앱 번들 생성] 옵션을 [사용 안 함]으로 설정)하고 다시 시도하세요.
zh_hans: 在指定测试容器中找不到任何测试。此外，Microsoft Windows 应用商店单元测试适配器不支持 .appxbundle 文件。在创建应用包时创建一个 appx (将“生成应用程序包”选项设置为“从不”)并重试。

# ParallelArgumentProcessorHelp
source: --Parallel|/Parallel Specifies that the tests be executed in parallel. By default up to all available cores on the machine may be used. The number of cores to use may be configured using a settings file.
cs: --Parallel|/Parallel Určí, že se testy mají provádět paralelně. Ve výchozím nastavení se můžou použít všechna dostupná jádra počítače. Počet jader, která se můžou použít, se dá nakonfigurovat v souboru nastavení.
ko: --Parallel|/Parallel 테스트가 병렬로 실행되도록 지정합니다. 기본적으로 컴퓨터에서 사용 가능한 모든 코어를 사용할 수 있습니다. 사용할 코어 수는 설정 파일을 사용하여 구성할 수 있습니다.
zh_hans: --Parallel|/Parallel 指定并行执行测试。默认情况下，最多 可能会使用计算机上所有可用的内核。 可使用设置文件配置要使用的内核数。

# InvalidParallelCommand
source: Argument {0} is not expected in the 'Parallel' command. Specify the command without the argument (Example: vstest.console.exe myTests.dll /Parallel) and try again.
cs: V příkazu Parallel se argument {0} neočekává. Zadejte příkaz bez tohoto argumentu (třeba vstest.console.exe myTests.dll /Parallel) a zkuste to znovu.
ko: 'Parallel' 명령에는 {0} 인수가 필요하지 않습니다. 인수 없이 명령을 지정한 다음(예: vstest.console.exe myTests.dll /Parallel) 다시 시도하세요.
zh_hans: 参数 {0} 不应出现在 "Parallel" 命令中。指定不带参数的命令(示例: vstest.console.exe myTests.dll /Parallel)，然后重试。

source: Cannot be null or empty
cs: Nemůže být null nebo prázdné.
ko: null이거나 비워 둘 수 없습니다.
zh_hans: 不能为 NULL 或为空

# PortArgumentHelp
source: --Port|/Port:<Port> The Port for socket connection and receiving the event messages.
cs: --Port|/Port:<port> Port pro připojení soketu a přijímání zpráv událostí
ko: --Port|/Port:<Port> 소켓 연결 및 이벤트 메시지 수신용 포트입니다.
zh_hans: --Port|/Port:<Port> 套接字连接和接收事件消息的端口。

# InvalidPortArgument
source: The --Port|/Port argument requires the port number which is an integer. Specify the port for socket connection and receiving the event messages.
cs: Argument --Port|/Port vyžaduje celočíselné číslo portu. Zadejte port pro připojení soketu a přijímání zpráv událostí.
ko: --Port|/Port 인수에는 정수인 포트 번호가 필요합니다. 소켓 연결 및 이벤트 메시지 수신에 사용할 포트를 지정하세요.
zh_hans: --Port|/Port 参数需要为整数的端口号。指定用于套接字连接以及接收事件消息的端口。

# AssemblyPathInvalid
source: Unable to find the assembly under test. Please make sure that the project is built.
cs: Nepovedlo se najít testované sestavení. Ujistěte se prosím, že je projekt sestavený.
ko: 테스트 중인 어셈블리를 찾을 수 없습니다. 프로젝트가 빌드되었는지 확인하세요.
zh_hans: 测试下找不到程序集。请确保已生成该项目。

# ProjectPathNotFound
source: The Path {0} does not exist.
cs: Cesta {0} neexistuje.
ko: {0} 경로가 없습니다.
zh_hans: 路径 {0} 不存在。

# BuildBasePathArgumentHelp
source: --BuildBasePath|/BuildBasePath:<BuildBasePath> The directory containing the temporary outputs.
cs: --BuildBasePath|/BuildBasePath:<BuildBasePath> Adresář, který obsahuje dočasné výstupy
ko: --BuildBasePath|/BuildBasePath:<BuildBasePath> 임시 출력을 포함하는 디렉터리입니다.
zh_hans: --BuildBasePath|/BuildBasePath:<BuildBasePath> 包含临时输出的目录。

# ConfigurationArgumentHelp
source: -c|--Configuration|/c|/Configuration:<Configuration> The configuration the project is built for i.e. Debug/Release
cs: -c|--Configuration|/c|/Configuration:<konfigurace> Konfigurace, pro kterou se projekt sestaví, tj. Debug/Release
ko: -c|--Configuration|/c|/Configuration:<Configuration> 디버그/릴리스를 위해 프로젝트가 빌드되는 구성입니다.
zh_hans: -c|--Configuration|/c|/Configuration:<Configuration> 项目为调试/发布等生成的配置

# InvalidConfiguration
source: The given configuration is invalid.
cs: Zadaná konfigurace není platná.
ko: 지정된 구성이 잘못되었습니다.
zh_hans: 给定的配置无效。

# OutputArgumentHelp
source: -o|--Output|/o|/Output:<Output> The directory containing the binaries to run.
cs: -o|--Output|/o|/Output:<výstup> Adresář, který obsahuje binární soubory, které se mají spustit
ko: -o|--Output|/o|/Output:<Output> 실행할 이진 파일을 포함하는 디렉터리입니다.
zh_hans: -o|--Output|/o|/Output:<Output> 包含要运行的二进制文件的目录。

# BuildBasePathNotFound
source: The BuildBasePath was not found, provide a valid path and try again.
cs: Cesta k základu sestavení se nenašla, zadejte platnou cestu a zkuste to znovu.
ko: BuildBasePath를 찾을 수 없습니다. 올바른 경로를 제공하고 다시 시도하세요.
zh_hans: 找不到 BuildBasePath，请提供有效的路径，然后重试。

# OutputPathNotFound
source: The Output path was not found, provide a valid path and try again.
cs: Cesta k výstupu se nenašla, zadejte platnou cestu a zkuste to znovu.
ko: 출력 경로를 찾을 수 없습니다. 올바른 경로를 제공하고 다시 시도하세요.
zh_hans: 找不到 Output 路径，请提供有效的路径，然后重试。

# AddnlInfoMessagesBanner
source: Additional Information Messages:
cs: Další informační zprávy:
ko: 추가 정보 메시지:
zh_hans: 其他信息性消息:

source: Days
cs: Dny
ko: 일
zh_hans: 天

# ErrorMessageBanner
source: Error Message:
cs: Chybová zpráva:
ko: 오류 메시지:
zh_hans: 错误消息:

# ExecutionTimeFormatString
source: Total time: {0:0.0000} {1}
cs: Celkový čas: {0:0.0000} {1}
ko: 총 시간: {0:0.0000} {1}
zh_hans: 总时间: {0:0.0000} {1}

source: Hours
cs: Hodiny
ko: 시간
zh_hans: 小时

# LoggerNotFound
source: Could not find a test logger with URI or FriendlyName '{0}'.
cs: Nepovedlo se najít protokolovač testu s identifikátorem URI nebo popisným názvem {0}.
ko: URI 또는 FriendlyName이 '{0}'인 테스트 로거를 찾을 수 없습니다.
zh_hans: 找不到 URI 或 FriendlyName 为“{0}”的测试记录器。

source: Minutes
cs: Minuty
ko: 분
zh_hans: 分钟

source: Seconds
cs: Sekundy
ko: 초
zh_hans: 秒

# StacktraceBanner
source: Stack Trace:
cs: Trasování zásobníku:
ko: 스택 추적:
zh_hans: 堆栈跟踪:

# StdErrMessagesBanner
source: Standard Error Messages:
cs: Zprávy standardních chyb:
ko: 표준 오류 메시지:
zh_hans: 标准错误消息:

# StdOutMessagesBanner
source: Standard Output Messages:
cs: Zprávy standardního výstupu:
ko: 표준 출력 메시지:
zh_hans: 标准输出消息:

# AttachmentsBanner
source: Attachments:
cs: Přílohy:
ko: 첨부 파일:
zh_hans: 附件:

# NoTestsAvailableInSources
source: No test is available in {0}. Make sure that installed test discoverers & executors, platform & framework version settings are appropriate and try again.
cs: V {0} nejsou dostupné žádné testy. Přesvědčte se, že nainstalované nástroje zjišťování testů, moduly provádění, nastavení verzí platformy a rozhraní jsou vhodné a zkuste to znova.
ko: {0}에서 테스트를 사용할 수 없습니다. 설치된 테스트 Discoverer와 Executor, 플랫폼 및 프레임워크 버전 설정이 적절한지 확인한 후에 다시 시도하세요.
zh_hans: {0} 中没有可用测试。请确保安装了适当的测试发现器和执行器且平台和框架版本设置合适，然后重试。

# FailedTestIndicator
source: Failed {0}
cs: Počet neúspěšných: {0}
ko: 실패 {0}
zh_hans: {0} 个失败

# PassedTestIndicator
source: Passed {0}
cs: Počet úspěšných: {0}
ko: 통과 {0}
zh_hans: 已通过 {0} 个

# SkippedTestIndicator
source: Skipped {0}
cs: Počet přeskočených: {0}
ko: 건너뜀 {0}
zh_hans: 已跳过 {0} 个

# DiscoveryFailed
source: Discovery failed for given sources. Exception : {0}
cs: Zjišťování pro dané zdroje selhalo. Výjimka: {0}
ko: 지정한 소스에 대한 검색이 실패했습니다. 예외: {0}
zh_hans: 针对给定源的发现失败。异常: {0}

# ParentProcessIdArgumentHelp
source: --ParentProcessId|/ParentProcessId:<ParentProcessId> Process Id of the Parent Process responsible for launching current process.
cs: --ParentProcessId|/ParentProcessId:<ParentProcessId> ID nadřazeného procesu, který je odpovědný za spuštění aktuálního procesu
ko: --ParentProcessId|/ParentProcessId:<ParentProcessId> 현재 프로세스를 시작해야 하는 부모 프로세스의 프로세스 ID입니다.
zh_hans: --ParentProcessId|/ParentProcessId:<ParentProcessId> 父进程的进程 ID 负责启动当前进程。

# InvalidParentProcessIdArgument
source: The --ParentProcessId|/ParentProcessId argument requires the process id which is an integer. Specify the process id of the parent process that launched this process.
cs: Argument --ParentProcessId|/ParentProcessId vyžaduje ID procesu, které je celočíselné. Zadejte ID nadřazeného procesu, který spustil tento proces.
ko: --ParentProcessId|/ParentProcessId 인수에는 정수인 프로세스 ID가 필요합니다. 이 프로세스를 시작한 부모 프로세스의 프로세스 ID를 지정하세요.
zh_hans: --ParentProcessId|/ParentProcessId 参数要求整数形式的进程 ID。指定启动此进程的父进程的进程 ID。

# HelpArgumentsText
source: Arguments:
cs: Argumenty:
ko: 인수:
zh_hans: 参数:

# EnableDiagUsage
source: --Diag|/Diag:<Path to log file> Enable logs for test platform. Logs are written to the provided file. Change the trace level for logs as shown below Example: /Diag:<Path to log file>;tracelevel=<Defaults to "verbose"> Allowed values for tracelevel: off, error, warning, info and verbose.
cs: --Diag|/Diag:<cesta k protokolu souboru> Povolit protokoly pro testovací platformu Protokoly se zapisují do zadaného souboru. Změňte úroveň trasování pro protokoly tak, jak je uvedeno níže. Příklad: /Diag:<cesta k protokolu souboru>;tracelevel=<výchozí hodnota je verbose> Povolené hodnoty pro tracelevel: off, error, warning, info a verbose
ko: --Diag|/Diag:<Path to log file> 테스트 플랫폼의 로그를 사용하도록 설정합니다. 로그는 제공된 파일에 기록됩니다. 아래 표시된 대로 로그의 추적 수준을 변경합니다. 예: /Diag:<Path to log file>;tracelevel=<Defaults to "verbose"> 허용되는 추적 수준 값: off, error, warning, info 및 verbose.
zh_hans: --Diag|/Diag:<Path to log file> 启用测试平台的日志。 日志将写入所提供的文件。 更改日志的跟踪级别，如下所示 示例: /Diag:<Path to log file>;tracelevel=<Defaults to "verbose"> 允许的 tracelevel 的值: off、error、 warning、info 和 verbose。

# LoggerFileIsReadOnly
source: The file {0} provided is read only
cs: Zadaný soubor {0} je jen pro čtení.
ko: 제공한 {0} 파일은 읽기 전용입니다.
zh_hans: 提供的文件 {0} 是只读文件

# DesignModeClientTimeoutError
source: Timeout to connect or process request for DesignModeClient on port: {0}
cs: Časový limit k propojení nebo zpracování žádosti pro DesignModeClient na portu: {0}
ko: 포트에서 DesignModeClient에 대한 요청을 연결하거나 처리하는 작업에 대한 시간 제한: {0}
zh_hans: 连接或处理端口 {0} 上 DesignModeClient 的请求超时

# CLIRunSettingsArgumentHelp
source: RunSettings arguments: Arguments to pass runsettings configurations through commandline. Arguments may be specified as name-value pair of the form [name]=[value] after "-- ". Note the space after --. Use a space to separate multiple [name]=[value]. More info on RunSettings arguments support: https://aka.ms/vstest-runsettings-arguments
cs: Argumenty RunSettings: Argumenty k předání konfigurací runsettings prostřednictvím příkazového řádku. Argumenty je možné zadat jako dvojici název-hodnota ve formě [název]=[hodnota] po -- . Po -- následuje mezera. K oddělení více dvojic [název]=[hodnota] použijte mezeru. Další informace o podpoře argumentů RunSettings: https://aka.ms/vstest-runsettings-arguments
ko: RunSettings 인수: 명령줄을 통해 runsettings 구성을 전달하기 위한 인수입니다. 인수는 "--" 뒤에 [name]=[value] 형식의 이름-값 쌍으로 지정할 수 있습니다. -- 뒤의 공백에 주의하세요. 여러 [name]=[value]를 구분하려면 공백을 사용합니다. RunSettings 인수 지원에 대한 자세한 정보: https://aka.ms/vstest-runsettings-arguments
zh_hans: RunSettings 参数: 通过命令行传递 runsettings 配置的参数。参数可以指定为名称-值对，其形式为“-- ”后跟 [名称]=[值]。请注意 -- 后的空格。 使用空格分隔多个 [名称]=[值]. 有关 RunSettings 参数支持的详细信息，请访问: https://aka.ms/vstest-runsettings-arguments

# MalformedRunSettingsKey
source: One or more runsettings provided contain invalid token
cs: Nejméně jedno z nastavení Runsettings obsahuje neplatný token
ko: 제공된 하나 이상의 runsettings에 잘못된 토큰이 포함되어 있습니다.
zh_hans: 所提供的一个或多个 runsettings 包含无效令牌

# ResultsDirectoryArgumentHelp
source: --ResultsDirectory|/ResultsDirectory Test results directory will be created in specified path if not exists. Example /ResultsDirectory:<pathToResultsDirectory>
cs: --ResultsDirectory|/ResultsDirectory Na zadané cestě se vytvoří adresář pro výsledky testů, pokud ještě neexistuje. Příklad: /ResultsDirectory:<pathToResultsDirectory>
ko: --ResultsDirectory|/ResultsDirectory 테스트 결과 디렉터리가 지정된 경로에 생성됩니다(없는 경우). 예: /ResultsDirectory:<pathToResultsDirectory>
zh_hans: -ResultsDirectory | / ResultsDirectory 如果不存在测试结果目录，则将在指定路径中创建。 示例 /ResultsDirectory:<pathToResultsDirectory>
